{
  "architectures": [
    "ModernBertForSequenceClassification"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "classifier_activation": "gelu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "cls",
  "cls_token_id": 6,
  "decoder_bias": true,
  "deterministic_flash_attn": false,
  "dtype": "float32",
  "embedding_dropout": 0.0,
  "eos_token_id": 2,
  "global_attn_every_n_layers": 3,
  "global_rope_theta": 160000.0,
  "gradient_checkpointing": false,
  "hidden_activation": "gelu",
  "hidden_size": 512,
  "id2label": {
    "0": "Ni",
    "1": "Ne",
    "2": "Si",
    "3": "Se",
    "4": "Ti",
    "5": "Te",
    "6": "Fi",
    "7": "Fe",
    "8": "none"
  },
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "label2id": {
    "Fe": 7,
    "Fi": 6,
    "Ne": 1,
    "Ni": 0,
    "Se": 3,
    "Si": 2,
    "Te": 5,
    "Ti": 4,
    "none": 8
  },
  "layer_norm_eps": 1e-05,
  "local_attention": 128,
  "local_rope_theta": 10000.0,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 8,
  "num_hidden_layers": 19,
  "pad_token_id": 3,
  "position_embedding_type": "rope",
  "repad_logits_with_grad": false,
  "sep_token_id": 4,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": false,
  "transformers_version": "4.57.6",
  "vocab_size": 102400
}
